Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP256GM710.h
extern volatile ODCDBITS ODCDbits __attribute__((__sfr__));

#define CNEND CNEND
extern volatile unsigned int  CNEND __attribute__((__sfr__));
typedef struct tagCNENDBITS {
  unsigned :1;
  unsigned CNIED1:1;
  unsigned CNIED2:1;
  unsigned CNIED3:1;
  unsigned CNIED4:1;
  unsigned CNIED5:1;
  unsigned CNIED6:1;
  unsigned :1;
  unsigned CNIED8:1;
  unsigned :3;
  unsigned CNIED12:1;
  unsigned CNIED13:1;
  unsigned CNIED14:1;
  unsigned CNIED15:1;
} CNENDBITS;
extern volatile CNENDBITS CNENDbits __attribute__((__sfr__));

#define CNPUD CNPUD
extern volatile unsigned int  CNPUD __attribute__((__sfr__));
typedef struct tagCNPUDBITS {
  unsigned :1;
  unsigned CNPUD1:1;
  unsigned CNPUD2:1;
  unsigned CNPUD3:1;
  unsigned CNPUD4:1;
  unsigned CNPUD5:1;
  unsigned CNPUD6:1;
  unsigned :1;
  unsigned CNPUD8:1;
  unsigned :3;
  unsigned CNPUD12:1;
  unsigned CNPUD13:1;
  unsigned CNPUD14:1;
  unsigned CNPUD15:1;
} CNPUDBITS;
extern volatile CNPUDBITS CNPUDbits __attribute__((__sfr__));

#define CNPDD CNPDD
extern volatile unsigned int  CNPDD __attribute__((__sfr__));
typedef struct tagCNPDDBITS {
  unsigned :1;
  unsigned CNPDD1:1;
  unsigned CNPDD2:1;
  unsigned CNPDD3:1;
  unsigned CNPDD4:1;
  unsigned CNPDD5:1;
  unsigned CNPDD6:1;
  unsigned :1;
  unsigned CNPDD8:1;
  unsigned :3;
  unsigned CNPDD12:1;
  unsigned CNPDD13:1;
  unsigned CNPDD14:1;
  unsigned CNPDD15:1;
} CNPDDBITS;
extern volatile CNPDDBITS CNPDDbits __attribute__((__sfr__));

#define ANSELD ANSELD
extern volatile unsigned int  ANSELD __attribute__((__sfr__));
typedef struct tagANSELDBITS {
  unsigned :14;
  unsigned ANSD14:1;
  unsigned ANSD15:1;
} ANSELDBITS;
extern volatile ANSELDBITS ANSELDbits __attribute__((__sfr__));

#define TRISE TRISE
extern volatile unsigned int  TRISE __attribute__((__sfr__));
typedef struct tagTRISEBITS {
  unsigned TRISE0:1;
  unsigned TRISE1:1;
  unsigned :6;
  unsigned TRISE8:1;
  unsigned TRISE9:1;
  unsigned :2;
  unsigned TRISE12:1;
  unsigned TRISE13:1;
  unsigned TRISE14:1;
  unsigned TRISE15:1;
} TRISEBITS;
extern volatile TRISEBITS TRISEbits __attribute__((__sfr__));

#define PORTE PORTE
extern volatile unsigned int  PORTE __attribute__((__sfr__));
typedef struct tagPORTEBITS {
  unsigned RE0:1;
  unsigned RE1:1;
  unsigned :6;
  unsigned RE8:1;
  unsigned RE9:1;
  unsigned :2;
  unsigned RE12:1;
  unsigned RE13:1;
  unsigned RE14:1;
  unsigned RE15:1;
} PORTEBITS;
extern volatile PORTEBITS PORTEbits __attribute__((__sfr__));

#define LATE LATE
extern volatile unsigned int  LATE __attribute__((__sfr__));
typedef struct tagLATEBITS {
  unsigned LATE0:1;
  unsigned LATE1:1;
  unsigned :6;
  unsigned LATE8:1;
  unsigned LATE9:1;
  unsigned :2;
  unsigned LATE12:1;
  unsigned LATE13:1;
  unsigned LATE14:1;
  unsigned LATE15:1;
} LATEBITS;
extern volatile LATEBITS LATEbits __attribute__((__sfr__));

#define ODCE ODCE
extern volatile unsigned int  ODCE __attribute__((__sfr__));
typedef struct tagODCEBITS {
  unsigned ODCE0:1;
  unsigned ODCE1:1;
  unsigned :6;
  unsigned ODCE8:1;
  unsigned ODCE9:1;
  unsigned :2;
  unsigned ODCE12:1;
  unsigned ODCE13:1;
  unsigned ODCE14:1;
  unsigned ODCE15:1;
} ODCEBITS;
extern volatile ODCEBITS ODCEbits __attribute__((__sfr__));

#define CNENE CNENE
extern volatile unsigned int  CNENE __attribute__((__sfr__));
typedef struct tagCNENEBITS {
  unsigned CNIEE0:1;
  unsigned CNIEE1:1;
  unsigned :6;
  unsigned CNIEE8:1;
  unsigned CNIEE9:1;
  unsigned :2;
  unsigned CNIEE12:1;
  unsigned CNIEE13:1;
  unsigned CNIEE14:1;
  unsigned CNIEE15:1;
} CNENEBITS;
extern volatile CNENEBITS CNENEbits __attribute__((__sfr__));

#define CNPUE CNPUE
extern volatile unsigned int  CNPUE __attribute__((__sfr__));
typedef struct tagCNPUEBITS {
  unsigned CNPUE0:1;
  unsigned CNPUE1:1;
  unsigned :6;
  unsigned CNPUE8:1;
  unsigned CNPUE9:1;
  unsigned :2;
  unsigned CNPUE12:1;
  unsigned CNPUE13:1;
  unsigned CNPUE14:1;
  unsigned CNPUE15:1;
} CNPUEBITS;
extern volatile CNPUEBITS CNPUEbits __attribute__((__sfr__));

#define CNPDE CNPDE
extern volatile unsigned int  CNPDE __attribute__((__sfr__));
typedef struct tagCNPDEBITS {
  unsigned CNPDE0:1;
  unsigned CNPDE1:1;
  unsigned :6;
  unsigned CNPDE8:1;
  unsigned CNPDE9:1;
  unsigned :2;
  unsigned CNPDE12:1;
  unsigned CNPDE13:1;
  unsigned CNPDE14:1;
  unsigned CNPDE15:1;
} CNPDEBITS;
extern volatile CNPDEBITS CNPDEbits __attribute__((__sfr__));

#define ANSELE ANSELE
extern volatile unsigned int  ANSELE __attribute__((__sfr__));
typedef struct tagANSELEBITS {
  unsigned ANSE0:1;
  unsigned ANSE1:1;
  unsigned :6;
  unsigned ANSE8:1;
  unsigned ANSE9:1;
  unsigned :2;
  unsigned ANSE12:1;
  unsigned ANSE13:1;
  unsigned ANSE14:1;
  unsigned ANSE15:1;
} ANSELEBITS;
extern volatile ANSELEBITS ANSELEbits __attribute__((__sfr__));

#define TRISF TRISF
extern volatile unsigned int  TRISF __attribute__((__sfr__));
typedef struct tagTRISFBITS {
  unsigned TRISF0:1;
  unsigned TRISF1:1;
  unsigned :2;
  unsigned TRISF4:1;
  unsigned TRISF5:1;
  unsigned TRISF6:1;
  unsigned TRISF7:1;
  unsigned :1;
  unsigned TRISF9:1;
  unsigned TRISF10:1;
  unsigned :1;
  unsigned TRISF12:1;
  unsigned TRISF13:1;
} TRISFBITS;
extern volatile TRISFBITS TRISFbits __attribute__((__sfr__));

#define PORTF PORTF
extern volatile unsigned int  PORTF __attribute__((__sfr__));
typedef struct tagPORTFBITS {
  unsigned RF0:1;
  unsigned RF1:1;
  unsigned :2;
  unsigned RF4:1;
  unsigned RF5:1;
  unsigned RF6:1;
  unsigned RF7:1;
  unsigned :1;
  unsigned RF9:1;
  unsigned RF10:1;
  unsigned :1;
  unsigned RF12:1;
  unsigned RF13:1;
} PORTFBITS;
extern volatile PORTFBITS PORTFbits __attribute__((__sfr__));

#define LATF LATF
extern volatile unsigned int  LATF __attribute__((__sfr__));
typedef struct tagLATFBITS {
  unsigned LATF0:1;
  unsigned LATF1:1;
  unsigned :2;
  unsigned LATF4:1;
  unsigned LATF5:1;
  unsigned LATF6:1;
  unsigned LATF7:1;
  unsigned :1;
  unsigned LATF9:1;
  unsigned LATF10:1;
  unsigned :1;
  unsigned LATF12:1;
  unsigned LATF13:1;
} LATFBITS;
