Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP256GM710.h
#define _AD2CSSL_CSS6_POSITION                   0x00000006
#define _AD2CSSL_CSS6_MASK                       0x00000040
#define _AD2CSSL_CSS6_LENGTH                     0x00000001

#define _AD2CSSL_CSS7_POSITION                   0x00000007
#define _AD2CSSL_CSS7_MASK                       0x00000080
#define _AD2CSSL_CSS7_LENGTH                     0x00000001

#define _AD2CSSL_CSS8_POSITION                   0x00000008
#define _AD2CSSL_CSS8_MASK                       0x00000100
#define _AD2CSSL_CSS8_LENGTH                     0x00000001

#define _AD2CSSL_CSS9_POSITION                   0x00000009
#define _AD2CSSL_CSS9_MASK                       0x00000200
#define _AD2CSSL_CSS9_LENGTH                     0x00000001

#define _AD2CSSL_CSS10_POSITION                  0x0000000A
#define _AD2CSSL_CSS10_MASK                      0x00000400
#define _AD2CSSL_CSS10_LENGTH                    0x00000001

#define _AD2CSSL_CSS11_POSITION                  0x0000000B
#define _AD2CSSL_CSS11_MASK                      0x00000800
#define _AD2CSSL_CSS11_LENGTH                    0x00000001

#define _AD2CSSL_CSS12_POSITION                  0x0000000C
#define _AD2CSSL_CSS12_MASK                      0x00001000
#define _AD2CSSL_CSS12_LENGTH                    0x00000001

#define _AD2CSSL_CSS13_POSITION                  0x0000000D
#define _AD2CSSL_CSS13_MASK                      0x00002000
#define _AD2CSSL_CSS13_LENGTH                    0x00000001

#define _AD2CSSL_CSS14_POSITION                  0x0000000E
#define _AD2CSSL_CSS14_MASK                      0x00004000
#define _AD2CSSL_CSS14_LENGTH                    0x00000001

#define _AD2CSSL_CSS15_POSITION                  0x0000000F
#define _AD2CSSL_CSS15_MASK                      0x00008000
#define _AD2CSSL_CSS15_LENGTH                    0x00000001

#define _AD2CON4_DMABL_POSITION                  0x00000000
#define _AD2CON4_DMABL_MASK                      0x00000007
#define _AD2CON4_DMABL_LENGTH                    0x00000003

#define _AD2CON4_ADDMAEN_POSITION                0x00000008
#define _AD2CON4_ADDMAEN_MASK                    0x00000100
#define _AD2CON4_ADDMAEN_LENGTH                  0x00000001

#define _AD2CON4_DMABL0_POSITION                 0x00000000
#define _AD2CON4_DMABL0_MASK                     0x00000001
#define _AD2CON4_DMABL0_LENGTH                   0x00000001

#define _AD2CON4_DMABL1_POSITION                 0x00000001
#define _AD2CON4_DMABL1_MASK                     0x00000002
#define _AD2CON4_DMABL1_LENGTH                   0x00000001

#define _AD2CON4_DMABL2_POSITION                 0x00000002
#define _AD2CON4_DMABL2_MASK                     0x00000004
#define _AD2CON4_DMABL2_LENGTH                   0x00000001

#define _C1CTRL1_WIN_POSITION                    0x00000000
#define _C1CTRL1_WIN_MASK                        0x00000001
#define _C1CTRL1_WIN_LENGTH                      0x00000001

#define _C1CTRL1_CANCAP_POSITION                 0x00000003
#define _C1CTRL1_CANCAP_MASK                     0x00000008
#define _C1CTRL1_CANCAP_LENGTH                   0x00000001

#define _C1CTRL1_OPMODE_POSITION                 0x00000005
#define _C1CTRL1_OPMODE_MASK                     0x000000E0
#define _C1CTRL1_OPMODE_LENGTH                   0x00000003

#define _C1CTRL1_REQOP_POSITION                  0x00000008
#define _C1CTRL1_REQOP_MASK                      0x00000700
#define _C1CTRL1_REQOP_LENGTH                    0x00000003

#define _C1CTRL1_CANCKS_POSITION                 0x0000000B
#define _C1CTRL1_CANCKS_MASK                     0x00000800
#define _C1CTRL1_CANCKS_LENGTH                   0x00000001

#define _C1CTRL1_ABAT_POSITION                   0x0000000C
#define _C1CTRL1_ABAT_MASK                       0x00001000
#define _C1CTRL1_ABAT_LENGTH                     0x00000001

#define _C1CTRL1_CSIDL_POSITION                  0x0000000D
#define _C1CTRL1_CSIDL_MASK                      0x00002000
#define _C1CTRL1_CSIDL_LENGTH                    0x00000001

#define _C1CTRL1_OPMODE0_POSITION                0x00000005
#define _C1CTRL1_OPMODE0_MASK                    0x00000020
#define _C1CTRL1_OPMODE0_LENGTH                  0x00000001

#define _C1CTRL1_OPMODE1_POSITION                0x00000006
#define _C1CTRL1_OPMODE1_MASK                    0x00000040
#define _C1CTRL1_OPMODE1_LENGTH                  0x00000001

#define _C1CTRL1_OPMODE2_POSITION                0x00000007
#define _C1CTRL1_OPMODE2_MASK                    0x00000080
#define _C1CTRL1_OPMODE2_LENGTH                  0x00000001

#define _C1CTRL1_REQOP0_POSITION                 0x00000008
#define _C1CTRL1_REQOP0_MASK                     0x00000100
#define _C1CTRL1_REQOP0_LENGTH                   0x00000001

#define _C1CTRL1_REQOP1_POSITION                 0x00000009
#define _C1CTRL1_REQOP1_MASK                     0x00000200
#define _C1CTRL1_REQOP1_LENGTH                   0x00000001

#define _C1CTRL1_REQOP2_POSITION                 0x0000000A
#define _C1CTRL1_REQOP2_MASK                     0x00000400
#define _C1CTRL1_REQOP2_LENGTH                   0x00000001

#define _C1CTRL2_DNCNT_POSITION                  0x00000000
#define _C1CTRL2_DNCNT_MASK                      0x0000001F
#define _C1CTRL2_DNCNT_LENGTH                    0x00000005

#define _C1CTRL2_DNCNT0_POSITION                 0x00000000
#define _C1CTRL2_DNCNT0_MASK                     0x00000001
#define _C1CTRL2_DNCNT0_LENGTH                   0x00000001

#define _C1CTRL2_DNCNT1_POSITION                 0x00000001
#define _C1CTRL2_DNCNT1_MASK                     0x00000002
#define _C1CTRL2_DNCNT1_LENGTH                   0x00000001

#define _C1CTRL2_DNCNT2_POSITION                 0x00000002
#define _C1CTRL2_DNCNT2_MASK                     0x00000004
#define _C1CTRL2_DNCNT2_LENGTH                   0x00000001

#define _C1CTRL2_DNCNT3_POSITION                 0x00000003
#define _C1CTRL2_DNCNT3_MASK                     0x00000008
#define _C1CTRL2_DNCNT3_LENGTH                   0x00000001

#define _C1CTRL2_DNCNT4_POSITION                 0x00000004
#define _C1CTRL2_DNCNT4_MASK                     0x00000010
#define _C1CTRL2_DNCNT4_LENGTH                   0x00000001

#define _C1VEC_ICODE_POSITION                    0x00000000
#define _C1VEC_ICODE_MASK                        0x0000007F
#define _C1VEC_ICODE_LENGTH                      0x00000007

#define _C1VEC_FILHIT_POSITION                   0x00000008
#define _C1VEC_FILHIT_MASK                       0x00001F00
#define _C1VEC_FILHIT_LENGTH                     0x00000005

#define _C1VEC_ICODE0_POSITION                   0x00000000
#define _C1VEC_ICODE0_MASK                       0x00000001
#define _C1VEC_ICODE0_LENGTH                     0x00000001

#define _C1VEC_ICODE1_POSITION                   0x00000001
#define _C1VEC_ICODE1_MASK                       0x00000002
#define _C1VEC_ICODE1_LENGTH                     0x00000001

